# Install Pandas Package

In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\salam\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\salam\anaconda3\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\salam\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\salam\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in c:\users\salam\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Note: you may need to restart the kernel to use updated packages.

# Import/Load Pandas Package

In [23]:
import pandas as pd

# Read CSV File

# Assessment 1 and 2

In [24]:
df = pd.read_csv ('C:\\Users\\salam\\Documents\\employee-data.csv', header = 0, encoding = 'unicode_escape')

In [25]:
# Print the first 5 rows of data to see sample data from employee data frame
df.head()

  Emp_ID First_Name   Last_Name  Emp_Lvl     Emp_Dept  Emp_Salary Emp_State
0    500       John  Thomposon       1.0        Sales       90000        VA
1    501      Bill        Blank      1.0      Finance       85000        MD
2    502      David     Jackson      0.0  Technology       110000        VA
3    502      David     Jackson      0.0  Technology       110000        VA
4    503      Jill       Jacobs      3.0           HR      120000        CA

#  Assessment 3

In [26]:
# computing number of rows
rows = len(df.axes[0])
  
# computing number of columns
columns  = len(df.axes[1])
  
print(df)
print("Number of Rows = ", rows)
print("Number of Columns =  ", columns)

  Emp_ID First_Name   Last_Name  Emp_Lvl     Emp_Dept  Emp_Salary Emp_State
0    500       John  Thomposon       1.0        Sales       90000        VA
1    501      Bill        Blank      1.0      Finance       85000        MD
2    502      David     Jackson      0.0  Technology       110000        VA
3    502      David     Jackson      0.0  Technology       110000        VA
4    503      Jill       Jacobs      3.0           HR      120000        CA
5    504   Michele           An      4.0       Cyber       145000        WA
6    505     Lauren    Friedman      5.0           HR      150000        NY
7    506       Amir        Khan      6.0  Technology       170000        NJ
8    507      Jake         Paul      NaN  Technology       175000        Nj
9   508%       Matt        Ryan      7.0           HR      190000        NY
Number of Rows =  10
Number of Columns =   7

# Assessment 4

In [27]:
df.isnull()

   Emp_ID  First_Name  Last_Name  Emp_Lvl  Emp_Dept  Emp_Salary  Emp_State
0   False       False      False    False     False       False      False
1   False       False      False    False     False       False      False
2   False       False      False    False     False       False      False
3   False       False      False    False     False       False      False
4   False       False      False    False     False       False      False
5   False       False      False    False     False       False      False
6   False       False      False    False     False       False      False
7   False       False      False    False     False       False      False
8   False       False      False     True     False       False      False
9   False       False      False    False     False       False      False

# Assessment 5

In [28]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [29]:
df.head()

  Emp_ID First_Name   Last_Name  Emp_Lvl     Emp_Dept  Emp_Salary Emp_State
0    500       John  Thomposon       1.0        Sales       90000        VA
1    501      Bill        Blank      1.0      Finance       85000        MD
2    502      David     Jackson      0.0  Technology       110000        VA
3    502      David     Jackson      0.0  Technology       110000        VA
4    503      Jill       Jacobs      3.0           HR      120000        CA

In [30]:
df.drop_duplicates()

  Emp_ID First_Name   Last_Name  Emp_Lvl     Emp_Dept  Emp_Salary Emp_State
0    500       John  Thomposon       1.0        Sales       90000        VA
1    501      Bill        Blank      1.0      Finance       85000        MD
2    502      David     Jackson      0.0  Technology       110000        VA
4    503      Jill       Jacobs      3.0           HR      120000        CA
5    504   Michele           An      4.0       Cyber       145000        WA
6    505     Lauren    Friedman      5.0           HR      150000        NY
7    506       Amir        Khan      6.0  Technology       170000        NJ
8    507      Jake         Paul      NaN  Technology       175000        Nj
9   508%       Matt        Ryan      7.0           HR      190000        NY

# Assessment 6

In [31]:
df.dtypes

Emp_ID         object
First_Name     object
Last_Name      object
Emp_Lvl       float64
Emp_Dept       object
Emp_Salary      int64
Emp_State      object
dtype: object

In [32]:
# Converting Emp_Salary data type from int to float 

df["Emp_Salary"].astype(float)

0     90000.0
1     85000.0
2    110000.0
3    110000.0
4    120000.0
5    145000.0
6    150000.0
7    170000.0
8    175000.0
9    190000.0
Name: Emp_Salary, dtype: float64